*** crates/paper-resolver/src/lib.rs:131:44: replace == with != in ResolverConfig::is_enabled

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace == with != in ResolverConfig::is_enabled
@@ -123,17 +123,17 @@
             extra_blocked_domains: vec![],
         }
     }
 }
 
 impl ResolverConfig {
     /// Check if a source is enabled by name.
     pub fn is_enabled(&self, name: &str) -> bool {
-        self.sources.iter().any(|s| s.name == name && s.enabled)
+        self.sources.iter().any(|s| s.name != /* ~ changed by cargo-mutants ~ */ name && s.enabled)
     }
 
     /// Get the priority (position index) for a source.
     pub fn priority(&self, name: &str) -> u8 {
         self.sources
             .iter()
             .position(|s| s.name == name)
             .map(|p| (p + 1) as u8)

*** result: Success
