*** crates/paper-resolver/src/lib.rs:131:9: replace ResolverConfig::is_enabled -> bool with false

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace ResolverConfig::is_enabled -> bool with false
@@ -123,17 +123,17 @@
             extra_blocked_domains: vec![],
         }
     }
 }
 
 impl ResolverConfig {
     /// Check if a source is enabled by name.
     pub fn is_enabled(&self, name: &str) -> bool {
-        self.sources.iter().any(|s| s.name == name && s.enabled)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the priority (position index) for a source.
     pub fn priority(&self, name: &str) -> u8 {
         self.sources
             .iter()
             .position(|s| s.name == name)
             .map(|p| (p + 1) as u8)

---- tests::resolve_arxiv_url_instant stdout ----

thread 'tests::resolve_arxiv_url_instant' panicked at crates/paper-resolver/src/lib.rs:771:24:
called `Option::unwrap()` on a `None` value

---- tests::resolve_arxiv_doi_instant stdout ----

thread 'tests::resolve_arxiv_doi_instant' panicked at crates/paper-resolver/src/lib.rs:763:9:
assertion `left == right` failed
  left: "openalex"
 right: "arxiv"

failures:
    tests::resolve_arxiv_doi_instant
    tests::resolve_arxiv_url_instant

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.56s

*** result: Failure(101)
