*** crates/paper-resolver/src/lib.rs:136:9: replace ResolverConfig::priority -> u8 with 1

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace ResolverConfig::priority -> u8 with 1
@@ -128,21 +128,17 @@
 impl ResolverConfig {
     /// Check if a source is enabled by name.
     pub fn is_enabled(&self, name: &str) -> bool {
         self.sources.iter().any(|s| s.name == name && s.enabled)
     }
 
     /// Get the priority (position index) for a source.
     pub fn priority(&self, name: &str) -> u8 {
-        self.sources
-            .iter()
-            .position(|s| s.name == name)
-            .map(|p| (p + 1) as u8)
-            .unwrap_or(99)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Default domains known to block programmatic downloads.
 const BLOCKED_DOMAINS: &[&str] = &[
     "academic.oup.com",
     "wiley.com",
     "www.sciencedirect.com",

*** result: Success
