*** crates/paper-resolver/src/lib.rs:138:34: replace == with != in ResolverConfig::priority

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace == with != in ResolverConfig::priority
@@ -130,17 +130,17 @@
     pub fn is_enabled(&self, name: &str) -> bool {
         self.sources.iter().any(|s| s.name == name && s.enabled)
     }
 
     /// Get the priority (position index) for a source.
     pub fn priority(&self, name: &str) -> u8 {
         self.sources
             .iter()
-            .position(|s| s.name == name)
+            .position(|s| s.name != /* ~ changed by cargo-mutants ~ */ name)
             .map(|p| (p + 1) as u8)
             .unwrap_or(99)
     }
 }
 
 /// Default domains known to block programmatic downloads.
 const BLOCKED_DOMAINS: &[&str] = &[
     "academic.oup.com",

*** result: Success
