*** crates/paper-resolver/src/lib.rs:139:25: replace + with - in ResolverConfig::priority

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace + with - in ResolverConfig::priority
@@ -131,17 +131,17 @@
         self.sources.iter().any(|s| s.name == name && s.enabled)
     }
 
     /// Get the priority (position index) for a source.
     pub fn priority(&self, name: &str) -> u8 {
         self.sources
             .iter()
             .position(|s| s.name == name)
-            .map(|p| (p + 1) as u8)
+            .map(|p| (p - /* ~ changed by cargo-mutants ~ */ 1) as u8)
             .unwrap_or(99)
     }
 }
 
 /// Default domains known to block programmatic downloads.
 const BLOCKED_DOMAINS: &[&str] = &[
     "academic.oup.com",
     "wiley.com",

*** result: Success
