*** crates/paper-resolver/src/lib.rs:158:5: replace _is_downloadable_with_config -> bool with false

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace _is_downloadable_with_config -> bool with false
@@ -150,27 +150,17 @@
     "www.nature.com",
     "www.tandfonline.com",
     "ieeexplore.ieee.org",
     "journals.sagepub.com",
     "silverchair.com",
 ];
 
 fn _is_downloadable_with_config(url: &str, config: &ResolverConfig) -> bool {
-    if BLOCKED_DOMAINS.iter().any(|d| url.contains(d)) {
-        return false;
-    }
-    if config
-        .extra_blocked_domains
-        .iter()
-        .any(|d| url.contains(d.as_str()))
-    {
-        return false;
-    }
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_downloadable(url: &str) -> bool {
     !BLOCKED_DOMAINS.iter().any(|d| url.contains(d))
 }
 
 /// Resolve a PDF URL using all available sources (default config).
 ///

*** result: Success
