*** crates/paper-resolver/src/lib.rs:172:5: replace is_downloadable -> bool with false

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace is_downloadable -> bool with false
@@ -164,17 +164,17 @@
         .any(|d| url.contains(d.as_str()))
     {
         return false;
     }
     true
 }
 
 fn is_downloadable(url: &str) -> bool {
-    !BLOCKED_DOMAINS.iter().any(|d| url.contains(d))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve a PDF URL using all available sources (default config).
 ///
 /// Convenience wrapper that uses [`ResolverConfig::default()`].
 /// For custom configuration, use [`resolve_pdf_with_config`].
 pub fn resolve_pdf(
     doi: Option<&str>,

---- tests::is_downloadable_ok stdout ----

thread 'tests::is_downloadable_ok' panicked at crates/paper-resolver/src/lib.rs:786:9:
assertion failed: is_downloadable("https://arxiv.org/pdf/2105.15183.pdf")

failures:
    tests::is_downloadable_ok

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
