*** crates/paper-resolver/src/lib.rs:184:5: replace resolve_pdf -> Option<ResolvedPdf> with None

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace resolve_pdf -> Option<ResolvedPdf> with None
@@ -176,17 +176,17 @@
 ///
 /// Convenience wrapper that uses [`ResolverConfig::default()`].
 /// For custom configuration, use [`resolve_pdf_with_config`].
 pub fn resolve_pdf(
     doi: Option<&str>,
     url: Option<&str>,
     title: Option<&str>,
 ) -> Option<ResolvedPdf> {
-    resolve_pdf_with_config(doi, url, title, &ResolverConfig::default())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve a PDF URL with custom configuration.
 ///
 /// Sync version — creates a tokio runtime internally.
 /// For async callers, use [`resolve_pdf_async`].
 pub fn resolve_pdf_with_config(
     doi: Option<&str>,

---- tests::resolve_arxiv_doi_instant stdout ----

thread 'tests::resolve_arxiv_doi_instant' panicked at crates/paper-resolver/src/lib.rs:762:24:
called `Option::unwrap()` on a `None` value

---- tests::resolve_arxiv_url_instant stdout ----

thread 'tests::resolve_arxiv_url_instant' panicked at crates/paper-resolver/src/lib.rs:771:24:
called `Option::unwrap()` on a `None` value

failures:
    tests::resolve_arxiv_doi_instant
    tests::resolve_arxiv_url_instant

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
