*** crates/paper-resolver/src/lib.rs:198:5: replace resolve_pdf_with_config -> Option<ResolvedPdf> with None

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace resolve_pdf_with_config -> Option<ResolvedPdf> with None
@@ -190,39 +190,17 @@
 /// For async callers, use [`resolve_pdf_async`].
 pub fn resolve_pdf_with_config(
     doi: Option<&str>,
     url: Option<&str>,
     title: Option<&str>,
     config: &ResolverConfig,
 ) -> Option<ResolvedPdf> {
     // 1. arXiv — instant, no network
-    if config.is_enabled("arxiv") {
-        if let Some(doi) = doi
-            && let Some(id) = doi_to_arxiv_id(doi)
-        {
-            return Some(ResolvedPdf {
-                url: format!("https://arxiv.org/pdf/{id}.pdf"),
-                source: "arxiv".into(),
-                downloadable: true,
-            });
-        }
-        if let Some(url) = url
-            && let Some(id) = url_to_arxiv_id(url)
-        {
-            return Some(ResolvedPdf {
-                url: format!("https://arxiv.org/pdf/{id}.pdf"),
-                source: "arxiv".into(),
-                downloadable: true,
-            });
-        }
-    }
-
-    // 2-9. Concurrent HTTP queries via tokio (shared runtime)
-    pdf_runtime().block_on(resolve_pdf_async(doi, title, config))
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Async version with configuration — caller owns the tokio runtime.
 ///
 /// All enabled sources are queried concurrently. Disabled sources are skipped.
 /// Source priority is determined by position in `config.sources` (first = highest).
 pub async fn resolve_pdf_async(
     doi: Option<&str>,

---- tests::resolve_arxiv_doi_instant stdout ----

thread 'tests::resolve_arxiv_doi_instant' panicked at crates/paper-resolver/src/lib.rs:740:24:
called `Option::unwrap()` on a `None` value

---- tests::resolve_arxiv_url_instant stdout ----

thread 'tests::resolve_arxiv_url_instant' panicked at crates/paper-resolver/src/lib.rs:749:24:
called `Option::unwrap()` on a `None` value

failures:
    tests::resolve_arxiv_doi_instant
    tests::resolve_arxiv_url_instant

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
