*** crates/paper-resolver/src/lib.rs:232:5: replace resolve_pdf_async -> Option<ResolvedPdf> with None

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace resolve_pdf_async -> Option<ResolvedPdf> with None
@@ -224,71 +224,17 @@
 ///
 /// All enabled sources are queried concurrently. Disabled sources are skipped.
 /// Source priority is determined by position in `config.sources` (first = highest).
 pub async fn resolve_pdf_async(
     doi: Option<&str>,
     title: Option<&str>,
     config: &ResolverConfig,
 ) -> Option<ResolvedPdf> {
-    let client = reqwest::Client::builder()
-        .timeout(std::time::Duration::from_secs(config.timeout_secs))
-        .redirect(reqwest::redirect::Policy::limited(10))
-        .build()
-        .ok()?;
-
-    // Fire enabled sources concurrently via join_all pattern
-    type PdfFuture<'a> =
-        std::pin::Pin<Box<dyn std::future::Future<Output = Option<(u8, ResolvedPdf)>> + Send + 'a>>;
-    let mut futures: Vec<PdfFuture<'_>> = Vec::new();
-
-    for source in &config.sources {
-        if !source.enabled {
-            continue;
-        }
-        let pri = config.priority(&source.name);
-        let c = &client;
-        match source.name.as_str() {
-            "arxiv" => {} // Already handled synchronously above
-            "openalex" => futures.push(Box::pin(async move {
-                try_openalex(c, doi, title).await.map(|r| (pri, r))
-            })),
-            "core" => futures.push(Box::pin(async move {
-                try_core(c, doi, title).await.map(|r| (pri, r))
-            })),
-            "google_scholar" => futures.push(Box::pin(async move {
-                try_google_scholar(c, title).await.map(|r| (pri, r))
-            })),
-            "unpaywall" => futures.push(Box::pin(async move {
-                try_unpaywall(c, doi).await.map(|r| (pri, r))
-            })),
-            "crossref" => futures.push(Box::pin(async move {
-                try_crossref(c, doi).await.map(|r| (pri, r))
-            })),
-            "zenodo" => futures.push(Box::pin(async move {
-                try_zenodo(c, title).await.map(|r| (pri, r))
-            })),
-            "ssrn" => futures.push(Box::pin(async move {
-                try_ssrn(c, title).await.map(|r| (pri, r))
-            })),
-            "semantic_scholar" => futures.push(Box::pin(async move {
-                try_semantic_scholar(c, doi, title).await.map(|r| (pri, r))
-            })),
-            _ => {} // Unknown source name, skip
-        }
-    }
-
-    let results = futures::future::join_all(futures).await;
-
-    // Collect successful results
-    let mut candidates: Vec<(u8, ResolvedPdf)> = results.into_iter().flatten().collect();
-
-    // Prefer downloadable, then highest priority (lowest number)
-    candidates.sort_by_key(|(pri, r)| (!r.downloadable, *pri));
-    candidates.into_iter().next().map(|(_, r)| r)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // arXiv helpers
 // ---------------------------------------------------------------------------
 
 fn doi_to_arxiv_id(doi: &str) -> Option<String> {
     doi.strip_prefix("10.48550/arXiv.").map(String::from)

*** result: Success
