*** crates/paper-resolver/src/lib.rs:244:12: delete ! in resolve_pdf_async

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ delete ! in resolve_pdf_async
@@ -236,17 +236,17 @@
         .ok()?;
 
     // Fire enabled sources concurrently via join_all pattern
     type PdfFuture<'a> =
         std::pin::Pin<Box<dyn std::future::Future<Output = Option<(u8, ResolvedPdf)>> + Send + 'a>>;
     let mut futures: Vec<PdfFuture<'_>> = Vec::new();
 
     for source in &config.sources {
-        if !source.enabled {
+        if  /* ~ changed by cargo-mutants ~ */source.enabled {
             continue;
         }
         let pri = config.priority(&source.name);
         let c = &client;
         match source.name.as_str() {
             "arxiv" => {} // Already handled synchronously above
             "openalex" => futures.push(Box::pin(async move {
                 try_openalex(c, doi, title).await.map(|r| (pri, r))

*** result: Success
