*** crates/paper-resolver/src/lib.rs:251:13: delete match arm "openalex" in resolve_pdf_async

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ delete match arm "openalex" in resolve_pdf_async
@@ -243,19 +243,17 @@
     for source in &config.sources {
         if !source.enabled {
             continue;
         }
         let pri = config.priority(&source.name);
         let c = &client;
         match source.name.as_str() {
             "arxiv" => {} // Already handled synchronously above
-            "openalex" => futures.push(Box::pin(async move {
-                try_openalex(c, doi, title).await.map(|r| (pri, r))
-            })),
+             /* ~ changed by cargo-mutants ~ */
             "core" => futures.push(Box::pin(async move {
                 try_core(c, doi, title).await.map(|r| (pri, r))
             })),
             "google_scholar" => futures.push(Box::pin(async move {
                 try_google_scholar(c, title).await.map(|r| (pri, r))
             })),
             "unpaywall" => futures.push(Box::pin(async move {
                 try_unpaywall(c, doi).await.map(|r| (pri, r))

*** result: Success
