*** crates/paper-resolver/src/lib.rs:254:13: delete match arm "core" in resolve_pdf_async

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ delete match arm "core" in resolve_pdf_async
@@ -246,19 +246,17 @@
         }
         let pri = config.priority(&source.name);
         let c = &client;
         match source.name.as_str() {
             "arxiv" => {} // Already handled synchronously above
             "openalex" => futures.push(Box::pin(async move {
                 try_openalex(c, doi, title).await.map(|r| (pri, r))
             })),
-            "core" => futures.push(Box::pin(async move {
-                try_core(c, doi, title).await.map(|r| (pri, r))
-            })),
+             /* ~ changed by cargo-mutants ~ */
             "google_scholar" => futures.push(Box::pin(async move {
                 try_google_scholar(c, title).await.map(|r| (pri, r))
             })),
             "unpaywall" => futures.push(Box::pin(async move {
                 try_unpaywall(c, doi).await.map(|r| (pri, r))
             })),
             "crossref" => futures.push(Box::pin(async move {
                 try_crossref(c, doi).await.map(|r| (pri, r))

*** result: Success
