*** crates/paper-resolver/src/lib.rs:257:13: delete match arm "google_scholar" in resolve_pdf_async

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ delete match arm "google_scholar" in resolve_pdf_async
@@ -249,19 +249,17 @@
         match source.name.as_str() {
             "arxiv" => {} // Already handled synchronously above
             "openalex" => futures.push(Box::pin(async move {
                 try_openalex(c, doi, title).await.map(|r| (pri, r))
             })),
             "core" => futures.push(Box::pin(async move {
                 try_core(c, doi, title).await.map(|r| (pri, r))
             })),
-            "google_scholar" => futures.push(Box::pin(async move {
-                try_google_scholar(c, title).await.map(|r| (pri, r))
-            })),
+             /* ~ changed by cargo-mutants ~ */
             "unpaywall" => futures.push(Box::pin(async move {
                 try_unpaywall(c, doi).await.map(|r| (pri, r))
             })),
             "crossref" => futures.push(Box::pin(async move {
                 try_crossref(c, doi).await.map(|r| (pri, r))
             })),
             "zenodo" => futures.push(Box::pin(async move {
                 try_zenodo(c, title).await.map(|r| (pri, r))

*** result: Success
