*** crates/paper-resolver/src/lib.rs:260:13: delete match arm "unpaywall" in resolve_pdf_async

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ delete match arm "unpaywall" in resolve_pdf_async
@@ -252,19 +252,17 @@
                 try_openalex(c, doi, title).await.map(|r| (pri, r))
             })),
             "core" => futures.push(Box::pin(async move {
                 try_core(c, doi, title).await.map(|r| (pri, r))
             })),
             "google_scholar" => futures.push(Box::pin(async move {
                 try_google_scholar(c, title).await.map(|r| (pri, r))
             })),
-            "unpaywall" => futures.push(Box::pin(async move {
-                try_unpaywall(c, doi).await.map(|r| (pri, r))
-            })),
+             /* ~ changed by cargo-mutants ~ */
             "crossref" => futures.push(Box::pin(async move {
                 try_crossref(c, doi).await.map(|r| (pri, r))
             })),
             "zenodo" => futures.push(Box::pin(async move {
                 try_zenodo(c, title).await.map(|r| (pri, r))
             })),
             "ssrn" => futures.push(Box::pin(async move {
                 try_ssrn(c, title).await.map(|r| (pri, r))

*** result: Success
