*** crates/paper-resolver/src/lib.rs:263:13: delete match arm "crossref" in resolve_pdf_async

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ delete match arm "crossref" in resolve_pdf_async
@@ -255,19 +255,17 @@
                 try_core(c, doi, title).await.map(|r| (pri, r))
             })),
             "google_scholar" => futures.push(Box::pin(async move {
                 try_google_scholar(c, title).await.map(|r| (pri, r))
             })),
             "unpaywall" => futures.push(Box::pin(async move {
                 try_unpaywall(c, doi).await.map(|r| (pri, r))
             })),
-            "crossref" => futures.push(Box::pin(async move {
-                try_crossref(c, doi).await.map(|r| (pri, r))
-            })),
+             /* ~ changed by cargo-mutants ~ */
             "zenodo" => futures.push(Box::pin(async move {
                 try_zenodo(c, title).await.map(|r| (pri, r))
             })),
             "ssrn" => futures.push(Box::pin(async move {
                 try_ssrn(c, title).await.map(|r| (pri, r))
             })),
             "semantic_scholar" => futures.push(Box::pin(async move {
                 try_semantic_scholar(c, doi, title).await.map(|r| (pri, r))

*** result: Success
