*** crates/paper-resolver/src/lib.rs:269:13: delete match arm "ssrn" in resolve_pdf_async

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ delete match arm "ssrn" in resolve_pdf_async
@@ -261,19 +261,17 @@
                 try_unpaywall(c, doi).await.map(|r| (pri, r))
             })),
             "crossref" => futures.push(Box::pin(async move {
                 try_crossref(c, doi).await.map(|r| (pri, r))
             })),
             "zenodo" => futures.push(Box::pin(async move {
                 try_zenodo(c, title).await.map(|r| (pri, r))
             })),
-            "ssrn" => futures.push(Box::pin(async move {
-                try_ssrn(c, title).await.map(|r| (pri, r))
-            })),
+             /* ~ changed by cargo-mutants ~ */
             "semantic_scholar" => futures.push(Box::pin(async move {
                 try_semantic_scholar(c, doi, title).await.map(|r| (pri, r))
             })),
             _ => {} // Unknown source name, skip
         }
     }
 
     let results = futures::future::join_all(futures).await;

*** result: Success
