*** crates/paper-resolver/src/lib.rs:272:13: delete match arm "semantic_scholar" in resolve_pdf_async

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ delete match arm "semantic_scholar" in resolve_pdf_async
@@ -264,19 +264,17 @@
                 try_crossref(c, doi).await.map(|r| (pri, r))
             })),
             "zenodo" => futures.push(Box::pin(async move {
                 try_zenodo(c, title).await.map(|r| (pri, r))
             })),
             "ssrn" => futures.push(Box::pin(async move {
                 try_ssrn(c, title).await.map(|r| (pri, r))
             })),
-            "semantic_scholar" => futures.push(Box::pin(async move {
-                try_semantic_scholar(c, doi, title).await.map(|r| (pri, r))
-            })),
+             /* ~ changed by cargo-mutants ~ */
             _ => {} // Unknown source name, skip
         }
     }
 
     let results = futures::future::join_all(futures).await;
 
     // Collect successful results
     let mut candidates: Vec<(u8, ResolvedPdf)> = results.into_iter().flatten().collect();

*** result: Success
