*** crates/paper-resolver/src/lib.rs:294:5: replace doi_to_arxiv_id -> Option<String> with None

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace doi_to_arxiv_id -> Option<String> with None
@@ -286,17 +286,17 @@
     candidates.into_iter().next().map(|(_, r)| r)
 }
 
 // ---------------------------------------------------------------------------
 // arXiv helpers
 // ---------------------------------------------------------------------------
 
 fn doi_to_arxiv_id(doi: &str) -> Option<String> {
-    doi.strip_prefix("10.48550/arXiv.").map(String::from)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn url_to_arxiv_id(url: &str) -> Option<String> {
     ARXIV_RE.captures(url).map(|c| c[1].to_string())
 }
 
 // ---------------------------------------------------------------------------
 // OpenAlex

---- tests::doi_to_arxiv_id_valid stdout ----

thread 'tests::doi_to_arxiv_id_valid' panicked at crates/paper-resolver/src/lib.rs:727:9:
assertion `left == right` failed
  left: None
 right: Some("2105.15183")

---- tests::resolve_arxiv_doi_instant stdout ----

thread 'tests::resolve_arxiv_doi_instant' panicked at crates/paper-resolver/src/lib.rs:763:9:
assertion `left == right` failed
  left: "openalex"
 right: "arxiv"

failures:
    tests::doi_to_arxiv_id_valid
    tests::resolve_arxiv_doi_instant

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.30s

*** result: Failure(101)
