*** crates/paper-resolver/src/lib.rs:294:5: replace doi_to_arxiv_id -> Option<String> with Some(String::new())

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace doi_to_arxiv_id -> Option<String> with Some(String::new())
@@ -286,17 +286,17 @@
     candidates.into_iter().next().map(|(_, r)| r)
 }
 
 // ---------------------------------------------------------------------------
 // arXiv helpers
 // ---------------------------------------------------------------------------
 
 fn doi_to_arxiv_id(doi: &str) -> Option<String> {
-    doi.strip_prefix("10.48550/arXiv.").map(String::from)
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn url_to_arxiv_id(url: &str) -> Option<String> {
     ARXIV_RE.captures(url).map(|c| c[1].to_string())
 }
 
 // ---------------------------------------------------------------------------
 // OpenAlex

---- tests::doi_to_arxiv_id_invalid stdout ----

thread 'tests::doi_to_arxiv_id_invalid' panicked at crates/paper-resolver/src/lib.rs:735:9:
assertion `left == right` failed
  left: Some("")
 right: None

---- tests::resolve_arxiv_doi_instant stdout ----

thread 'tests::resolve_arxiv_doi_instant' panicked at crates/paper-resolver/src/lib.rs:764:9:
assertion `left == right` failed
  left: "https://arxiv.org/pdf/.pdf"
 right: "https://arxiv.org/pdf/2105.15183.pdf"

---- tests::doi_to_arxiv_id_valid stdout ----

thread 'tests::doi_to_arxiv_id_valid' panicked at crates/paper-resolver/src/lib.rs:727:9:
assertion `left == right` failed
  left: Some("")
 right: Some("2105.15183")

failures:
    tests::doi_to_arxiv_id_invalid
    tests::doi_to_arxiv_id_valid
    tests::resolve_arxiv_doi_instant

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
