*** crates/paper-resolver/src/lib.rs:298:5: replace url_to_arxiv_id -> Option<String> with None

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace url_to_arxiv_id -> Option<String> with None
@@ -290,17 +290,17 @@
 // arXiv helpers
 // ---------------------------------------------------------------------------
 
 fn doi_to_arxiv_id(doi: &str) -> Option<String> {
     doi.strip_prefix("10.48550/arXiv.").map(String::from)
 }
 
 fn url_to_arxiv_id(url: &str) -> Option<String> {
-    ARXIV_RE.captures(url).map(|c| c[1].to_string())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // OpenAlex
 // ---------------------------------------------------------------------------
 
 async fn try_openalex(
     client: &reqwest::Client,

---- tests::url_to_arxiv_id_abs stdout ----

thread 'tests::url_to_arxiv_id_abs' panicked at crates/paper-resolver/src/lib.rs:740:9:
assertion `left == right` failed
  left: None
 right: Some("2105.15183")

---- tests::url_to_arxiv_id_pdf_versioned stdout ----

thread 'tests::url_to_arxiv_id_pdf_versioned' panicked at crates/paper-resolver/src/lib.rs:748:9:
assertion `left == right` failed
  left: None
 right: Some("2105.15183v2")

---- tests::resolve_arxiv_url_instant stdout ----

thread 'tests::resolve_arxiv_url_instant' panicked at crates/paper-resolver/src/lib.rs:771:24:
called `Option::unwrap()` on a `None` value

failures:
    tests::resolve_arxiv_url_instant
    tests::url_to_arxiv_id_abs
    tests::url_to_arxiv_id_pdf_versioned

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
