*** crates/paper-resolver/src/lib.rs:298:5: replace url_to_arxiv_id -> Option<String> with Some(String::new())

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace url_to_arxiv_id -> Option<String> with Some(String::new())
@@ -290,17 +290,17 @@
 // arXiv helpers
 // ---------------------------------------------------------------------------
 
 fn doi_to_arxiv_id(doi: &str) -> Option<String> {
     doi.strip_prefix("10.48550/arXiv.").map(String::from)
 }
 
 fn url_to_arxiv_id(url: &str) -> Option<String> {
-    ARXIV_RE.captures(url).map(|c| c[1].to_string())
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // OpenAlex
 // ---------------------------------------------------------------------------
 
 async fn try_openalex(
     client: &reqwest::Client,

---- tests::url_to_arxiv_id_non_arxiv stdout ----

thread 'tests::url_to_arxiv_id_non_arxiv' panicked at crates/paper-resolver/src/lib.rs:756:9:
assertion `left == right` failed
  left: Some("")
 right: None

---- tests::url_to_arxiv_id_pdf_versioned stdout ----

thread 'tests::url_to_arxiv_id_pdf_versioned' panicked at crates/paper-resolver/src/lib.rs:748:9:
assertion `left == right` failed
  left: Some("")
 right: Some("2105.15183v2")

---- tests::url_to_arxiv_id_abs stdout ----

thread 'tests::url_to_arxiv_id_abs' panicked at crates/paper-resolver/src/lib.rs:740:9:
assertion `left == right` failed
  left: Some("")
 right: Some("2105.15183")

failures:
    tests::resolve_arxiv_url_instant
    tests::url_to_arxiv_id_abs
    tests::url_to_arxiv_id_non_arxiv
    tests::url_to_arxiv_id_pdf_versioned

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
