*** crates/paper-resolver/src/lib.rs:422:5: replace try_google_scholar -> Option<ResolvedPdf> with None

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace try_google_scholar -> Option<ResolvedPdf> with None
@@ -414,60 +414,17 @@
     None
 }
 
 // ---------------------------------------------------------------------------
 // Google Scholar
 // ---------------------------------------------------------------------------
 
 async fn try_google_scholar(client: &reqwest::Client, title: Option<&str>) -> Option<ResolvedPdf> {
-    let title = title?;
-    let resp = client
-        .get("https://scholar.google.com/scholar")
-        .query(&[("q", &format!("\"{title}\"")), ("num", &"5".to_string())])
-        .header("User-Agent", "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36")
-        .header("Accept", "text/html")
-        .send().await.ok()?;
-
-    if !resp.status().is_success() {
-        return None;
-    }
-    let html = resp.text().await.ok()?;
-
-    let academic_hosts = [
-        ".edu",
-        ".ac.uk",
-        "research.google",
-        "hal.science",
-        "eprint.iacr.org",
-    ];
-
-    // Prefer academic hosts
-    for cap in PDF_HREF_RE.captures_iter(&html) {
-        let url = &cap[1];
-        if academic_hosts.iter().any(|h| url.contains(h)) {
-            return Some(ResolvedPdf {
-                url: url.into(),
-                source: "google_scholar".into(),
-                downloadable: true,
-            });
-        }
-    }
-    // Fallback: any downloadable PDF
-    for cap in PDF_HREF_RE.captures_iter(&html) {
-        let url = &cap[1];
-        if is_downloadable(url) {
-            return Some(ResolvedPdf {
-                url: url.into(),
-                source: "google_scholar".into(),
-                downloadable: true,
-            });
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Unpaywall
 // ---------------------------------------------------------------------------
 
 async fn try_unpaywall(client: &reqwest::Client, doi: Option<&str>) -> Option<ResolvedPdf> {
     let doi = doi?;

*** result: Success
