*** crates/paper-resolver/src/lib.rs:473:5: replace try_unpaywall -> Option<ResolvedPdf> with None

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace try_unpaywall -> Option<ResolvedPdf> with None
@@ -465,53 +465,17 @@
     None
 }
 
 // ---------------------------------------------------------------------------
 // Unpaywall
 // ---------------------------------------------------------------------------
 
 async fn try_unpaywall(client: &reqwest::Client, doi: Option<&str>) -> Option<ResolvedPdf> {
-    let doi = doi?;
-    let resp = client
-        .get(format!("https://api.unpaywall.org/v2/{doi}"))
-        .query(&[("email", "zotero-mcp@example.com")])
-        .send()
-        .await
-        .ok()?;
-
-    if !resp.status().is_success() {
-        return None;
-    }
-    let data: serde_json::Value = resp.json().await.ok()?;
-
-    if let Some(url) = data
-        .pointer("/best_oa_location/url_for_pdf")
-        .and_then(|v| v.as_str())
-    {
-        return Some(ResolvedPdf {
-            url: url.into(),
-            source: "unpaywall".into(),
-            downloadable: is_downloadable(url),
-        });
-    }
-    for loc in data
-        .get("oa_locations")
-        .and_then(|v| v.as_array())
-        .unwrap_or(&vec![])
-    {
-        if let Some(url) = loc.get("url_for_pdf").and_then(|v| v.as_str()) {
-            return Some(ResolvedPdf {
-                url: url.into(),
-                source: "unpaywall".into(),
-                downloadable: is_downloadable(url),
-            });
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Crossref
 // ---------------------------------------------------------------------------
 
 async fn try_crossref(client: &reqwest::Client, doi: Option<&str>) -> Option<ResolvedPdf> {
     let doi = doi?;

*** result: Success
