*** crates/paper-resolver/src/lib.rs:574:5: replace try_zenodo -> Option<ResolvedPdf> with None

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace try_zenodo -> Option<ResolvedPdf> with None
@@ -566,56 +566,17 @@
     None
 }
 
 // ---------------------------------------------------------------------------
 // Zenodo
 // ---------------------------------------------------------------------------
 
 async fn try_zenodo(client: &reqwest::Client, title: Option<&str>) -> Option<ResolvedPdf> {
-    let title = title?;
-    let resp = client
-        .get("https://zenodo.org/api/records")
-        .query(&[("q", title), ("size", "3"), ("type", "publication")])
-        .send()
-        .await
-        .ok()?;
-
-    if !resp.status().is_success() {
-        return None;
-    }
-    let data: serde_json::Value = resp.json().await.ok()?;
-
-    for hit in data
-        .pointer("/hits/hits")
-        .and_then(|v| v.as_array())
-        .unwrap_or(&vec![])
-    {
-        for file in hit
-            .get("files")
-            .and_then(|v| v.as_array())
-            .unwrap_or(&vec![])
-        {
-            if file
-                .get("key")
-                .and_then(|v| v.as_str())
-                .unwrap_or("")
-                .to_lowercase()
-                .ends_with(".pdf")
-                && let Some(url) = file.pointer("/links/self").and_then(|v| v.as_str())
-            {
-                return Some(ResolvedPdf {
-                    url: url.into(),
-                    source: "zenodo".into(),
-                    downloadable: true,
-                });
-            }
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // SSRN
 // ---------------------------------------------------------------------------
 
 async fn try_ssrn(client: &reqwest::Client, title: Option<&str>) -> Option<ResolvedPdf> {
     let title = title?;

*** result: Success
