*** crates/paper-resolver/src/lib.rs:621:5: replace try_ssrn -> Option<ResolvedPdf> with None

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace try_ssrn -> Option<ResolvedPdf> with None
@@ -613,39 +613,17 @@
     None
 }
 
 // ---------------------------------------------------------------------------
 // SSRN
 // ---------------------------------------------------------------------------
 
 async fn try_ssrn(client: &reqwest::Client, title: Option<&str>) -> Option<ResolvedPdf> {
-    let title = title?;
-    let resp = client
-        .get("https://papers.ssrn.com/sol3/results.cfm")
-        .query(&[("txtKey_Words", title), ("npage", "1")])
-        .header("User-Agent", "Mozilla/5.0")
-        .header("Accept", "text/html")
-        .send()
-        .await
-        .ok()?;
-
-    if !resp.status().is_success() {
-        return None;
-    }
-    let html = resp.text().await.ok()?;
-
-    if let Some(cap) = SSRN_RE.captures(&html) {
-        return Some(ResolvedPdf {
-            url: cap[1].to_string(),
-            source: "ssrn".into(),
-            downloadable: false,
-        });
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Semantic Scholar
 // ---------------------------------------------------------------------------
 
 async fn try_semantic_scholar(
     client: &reqwest::Client,

*** result: Success
