*** crates/paper-resolver/src/lib.rs:655:5: replace try_semantic_scholar -> Option<ResolvedPdf> with None

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace try_semantic_scholar -> Option<ResolvedPdf> with None
@@ -647,80 +647,17 @@
 // Semantic Scholar
 // ---------------------------------------------------------------------------
 
 async fn try_semantic_scholar(
     client: &reqwest::Client,
     doi: Option<&str>,
     title: Option<&str>,
 ) -> Option<ResolvedPdf> {
-    let resp = if let Some(doi) = doi {
-        client
-            .get(format!(
-                "https://api.semanticscholar.org/graph/v1/paper/DOI:{doi}"
-            ))
-            .query(&[("fields", "openAccessPdf")])
-            .send()
-            .await
-            .ok()?
-    } else {
-        let title = title?;
-        client
-            .get("https://api.semanticscholar.org/graph/v1/paper/search")
-            .query(&[
-                ("query", title),
-                ("limit", "1"),
-                ("fields", "openAccessPdf"),
-            ])
-            .send()
-            .await
-            .ok()?
-    };
-
-    if !resp.status().is_success() {
-        return None;
-    }
-    let data: serde_json::Value = resp.json().await.ok()?;
-
-    let work = if let Some(items) = data.get("data").and_then(|v| v.as_array()) {
-        items.first()?
-    } else {
-        &data
-    };
-
-    let oa = work.get("openAccessPdf")?;
-    if let Some(url) = oa.get("url").and_then(|v| v.as_str()) {
-        return Some(ResolvedPdf {
-            url: url.into(),
-            source: "semantic_scholar".into(),
-            downloadable: is_downloadable(url),
-        });
-    }
-    // Disclaimer fallback
-    if let Some(disclaimer) = oa.get("disclaimer").and_then(|v| v.as_str()) {
-        for m in URL_RE.find_iter(disclaimer) {
-            let url = m.as_str();
-            if url.contains("arxiv.org/abs/") {
-                let pdf_url = url.replace("/abs/", "/pdf/");
-                return Some(ResolvedPdf {
-                    url: format!("{pdf_url}.pdf"),
-                    source: "semantic_scholar".into(),
-                    downloadable: true,
-                });
-            }
-            if !url.contains("arxiv.org") || url.contains("/pdf/") {
-                return Some(ResolvedPdf {
-                    url: url.into(),
-                    source: "semantic_scholar".into(),
-                    downloadable: is_downloadable(url),
-                });
-            }
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn doi_to_arxiv_id_valid() {

*** result: Success
