*** crates/paper-resolver/src/lib.rs:709:43: replace || with && in try_semantic_scholar

*** mutation diff:
--- crates/paper-resolver/src/lib.rs
+++ replace || with && in try_semantic_scholar
@@ -701,17 +701,17 @@
             if url.contains("arxiv.org/abs/") {
                 let pdf_url = url.replace("/abs/", "/pdf/");
                 return Some(ResolvedPdf {
                     url: format!("{pdf_url}.pdf"),
                     source: "semantic_scholar".into(),
                     downloadable: true,
                 });
             }
-            if !url.contains("arxiv.org") || url.contains("/pdf/") {
+            if !url.contains("arxiv.org") && /* ~ changed by cargo-mutants ~ */ url.contains("/pdf/") {
                 return Some(ResolvedPdf {
                     url: url.into(),
                     source: "semantic_scholar".into(),
                     downloadable: is_downloadable(url),
                 });
             }
         }
     }

*** result: Success
